{"index": {"_index": "hr", "_id": "1"}}
{"id": 1, "title": "Performance Management and Career Planning", "content": "One of the new features of performance management is that it will link to staff development and learning management to allow for better career planning. Applying for a position The improved learning management system in Inspira will make it easier to enroll, track and keep records of learning programs, including the mandatory courses in which you have you have participated. Moreover, the skills portal provides anytime, anywhere access to online learning programs."}
{"index": {"_index": "hr", "_id": "2"}}
{"id": 2, "title": "How is performance management linked to development in Western Digital?", "content": "At Western Digital, performance management is strongly connected to employee development. The company invests in a comprehensive learning management system that helps employees track their progress, set goals, and develop new skills. This performance management approach aligns with the company's commitment to continuous growth and employee satisfaction, ensuring that staff have the resources they need to thrive in their careers."}
{"index": {"_index": "hr", "_id": "3"}}
{"id": 3, "title": "Flexible Work Arrangements at Western Digital", "content": "Western Digital understands the importance of work-life balance and offers flexible work arrangements to accommodate the diverse needs of its employees. These arrangements include remote work options, flexible working hours, and job-sharing opportunities. By providing a supportive work environment, Western Digital aims to boost employee satisfaction, productivity, and overall well-being."}
{"index": {"_index": "hr", "_id": "4"}}
{"id": 4, "title": "Employee Benefits and Compensation at Western Digital", "content": "Western Digital is committed to providing competitive compensation and a comprehensive benefits package to attract and retain top talent. The company offers various benefits, including health insurance, retirement savings plans, paid time off, and professional development opportunities. Western Digital continually reviews its compensation and benefits policies to ensure they remain competitive in the market."}
{"index": {"_index": "hr", "_id": "5"}}
{"id": 5, "title": "Diversity and Inclusion at Western Digital", "content": "Western Digital believes in fostering a diverse and inclusive workplace that reflects the global community in which it operates. The company is dedicated to promoting equal opportunities for all employees, regardless of race, gender, age, religion, sexual orientation, or disability. Western Digital's commitment to diversity and inclusion not only helps create a more innovative and collaborative work environment but also contributes to the company's success in the global market."}
